In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame({'Ohio':{'2000':1.2,'2001':1.5,'2002':1.7},'California':{'2000':1,'2001':1.5,'2002':2}})

In [4]:
df

      Ohio  California
2000   1.2         1.0
2001   1.5         1.5
2002   1.7         2.0

In [5]:
#df.index=['2002','2000','2003','2005']   you cannot add new indexes
#df.columns=['California','Ohio','India']   you cannot add new coulumns too
df1=df.reindex(['2002','2000','2003','2005'],columns=['California','Ohio','India']) #this method is nice

In [6]:
df1['India']=np.arange(1,5)

In [7]:
df1

      California  Ohio  India
2002         2.0   1.7      1
2000         1.0   1.2      2
2003         NaN   NaN      3
2005         NaN   NaN      4

In [8]:
df1.reindex(columns=['California','Ohio','India','USA'],fill_value=2)

      California  Ohio  India  USA
2002         2.0   1.7      1    2
2000         1.0   1.2      2    2
2003         NaN   NaN      3    2
2005         NaN   NaN      4    2

In [9]:
#loc method is usually.
df2=df.loc[['2002','2000'],['California','Ohio']]     #dont give missing columns or rows in loc :(

In [10]:
df2

      California  Ohio
2002         2.0   1.7
2000         1.0   1.2

In [11]:
#How to drop values along any axis? df.drop comes to rescue

In [12]:
df

      Ohio  California
2000   1.2         1.0
2001   1.5         1.5
2002   1.7         2.0

In [13]:
df.drop(['Ohio'],axis=1)         #axis 1 means across the columns

      California
2000         1.0
2001         1.5
2002         2.0

In [14]:
df.drop(['2000'],inplace=True)                 #default is axis 0 along rows!   #inplace allows permanent removal

In [15]:
df

      Ohio  California
2001   1.5         1.5
2002   1.7         2.0